{
    "roguecraft.tutorial.introduction.content": "\n§l로그크래프트§r에 오신 것을 환영합니다. 이는 로그라이트 데이터팩입니다. 이미 로그라이트가 무엇인지 알고 계신다면, 4쪽으로 건너뛰셔도 좋습니다.\n\n로그라이트는 로그라이크 장르의 변형으로, 세계가 무작위로 생성되고 게임 루프가 여러 런으로 분리됩니다. 로그라이크에서는 죽으면 모든 진행 상황을 잃지만, 로그라이트에서는 죽어도 진행 상황의 일부를 유지할 수 있습니다. 이 경우에는 영구적인 강화를 잠금 해제하는 것이 포함되며, 이는 미래의 런 동안 크게 도움이 될 것입니다. 현재 최종 목표는 엔더 드래곤을 처치하는 것입니다.\n\n\n§l튜토리얼§r\n\n현재 튜토리얼에 위치해 있으며, 데이터팩에 관한 모든 것을 배울 수 있습니다. 이 독서대 왼쪽에 있는 제작법을 적어도 확인해 보는 것을 권장합니다.\n\n직접 경험해보고 싶다면, 필요할 때마다 여정 중 도움이 되는 정보 메시지를 받게 될 것입니다. 원하신다면 '/trigger toggle_info_messages' 명령어를 실행하여 그것들을 비활성화할 수도 있습니다.런 중에 관심 지점을 찾는 데 도움이 필요하다면, 자석석 나침반 강화를 구매하세요. \n\n공식 위키를 참조하려면 %s.\n\n무엇을 하시든, 로그크래프트에서 행운을 빕니다. 즐겁게 즐기세요!\n",
    "roguecraft.tutorial.wiki_link": "여기를 클릭하세요",
    "roguecraft.tutorial.skillpoints.content": "\n스킬 포인트는 로그크래프트에서 가장 중요한 자원입니다. 허브에서 강화, 능력 및 직업을 구매하는 데 사용할 수 있습니다. \n\n스킬 포인트는 구조물 약탈, 발전 과제를 달성하거나, 제일 중요하게도 제작을 통해 이 정보 지점 뒤에 있는 제작법을 사용하여 얻을 수 있습니다.\n\n새로운 플레이를 시작하면 사용하지 않은 모든 스킬 포인트를 잃게 되므로, 바로 사용해야 합니다.\n\n\n§l스킬 젬§r\n\n이것들은 스킬 포인트(정보 지점 뒤 제작법 중앙에 있는 아이템)의 핵심 제작 재료입니다.\n\n스킬 젬은 경험치 레벨을 높여서 얻으며, 점점 더 얻기 어려워집니다. 경험치 레벨을 낮추더라도 이미 도달했던 레벨에 다시 도달해도 추가 스킬 젬을 얻지 못합니다. 예를 들어, 레벨을 21에서 20으로 낮추면 레벨 21에 다시 도달해도 두 번째 스킬 젬을 얻지 못합니다.\n\n\n§l몹 정수§r\n\n이 제작 재료는 어떤 몹을 죽여도 얻을 수 있습니다. 몹이 희귀하거나 강할수록 더 좋은 몹 정수를 드롭합니다.\n\n특정 몹을 일정량 죽이면 드롭 품질이 저하되어 저가치 몹 정수만 떨어뜨리게 되므로, 더 좋은 몹 정수를 얻으려면 다른 몹을 죽여야 합니다. 이 상태는 새로운 플레이를 시작하면 끝납니다.",

    "roguecraft.tutorial.vanilla_changes.content": "\n이 데이터팩을 플레이하면서 얻을 강화는 매우 강력하므로, 이를 균형 잡기 위해 게임이 상당히 더 어려워졌습니다.\n\n첫 번째 변경 사항은 시작 체력이 기존 10하트에서 5하트로 줄어든 것입니다. 이로 인해 초반 생존이 훨씬 더 어려워지므로, 초반에 체력 강화에 투자하는 것이 좋은 생각일 수 있습니다.\n\n두 번째 변경 사항은 훨씬 더 영향력이 큽니다. 허브에서 갑옷, 도구 및 무기 강화를 잠금 해제할 수 있기 때문에, 모든 제작법이 비활성화됩니다. 당신은 더 이상 도구(곡괭이, 삽, 도끼, 괭이), 무기(검과 활), 갑옷을 제작할 수 없습니다. 여전히 제작할 수 있는 주목할 만한 아이템들로는 부싯돌과 부시, 양동이, 방패, 거북 투구, 가위, 낚싯대가 있습니다. 도구 없이는 게임을 클리어하는 것이 불가능하기 때문에, 돌 곡괭이로 시작합니다.\n\n이것은 양동이로 차원문을 짓는 것과 같은 몇몇 스피드런 기술과 결합하여 이론적으로는 전체 게임을 클리어하기에 충분합니다. 또한, 강화를 통해 얻은 모든 도구는 부서지지 않습니다.\n\n다음으로, 제작법이 비활성화되더라도, 이러한 아이템 중 일부는 여전히 노획물 상자나 주민 거래에서 나타날 것입니다. 이것은 \"런 중 강화\"에서 더 자세히 설명될 것입니다.\n\n마지막으로, 게임의 일부는 이 데이터팩의 핵심 루프와 더 잘 작동하도록 수정되었으며, 주로 구조물을 포함합니다.",

    "roguecraft.tutorial.abilities_and_classes.content": "\n§l능력§r\n\n능력은 강력한 활성 주문입니다.\n\n능력은 허브에서 구매할 수 있으며, 그 후에는 마법서 중 하나를 들고 상점을 클릭하여 그 책을 상점에 표시된 능력에 연결해야 합니다. 기본적으로 3개의 마법서를 가지고 있거나, 마법사 클래스를 선택하면 4개를 가집니다. 이것들은 능력을 바인딩한 후 런 중에 인벤토리에 나타나며, 우클릭으로 시전할 수 있습니다. 능력에는 재사용 대기시간이 없지만 마나가 필요합니다.\n\n\n§l주문서§r\n\n주문서는 1회용 능력으로 작동하며 대부분 노획물 상자에서 발견됩니다. 일반 능력이나 직업 능력일 수 있으며 대부분 비용이 없지만 일부 예외가 있습니다. 복제 능력을 사용하여 원하는 만큼 사용할 수도 있습니다.\n\n\n§l마나§r\n\n첫 번째 능력을 바인딩하면 화면 상단에 마나 바가 나타납니다. 이는 주문 시전에 필요한 자원인 현재 마나 양을 알려줍니다. 마나는 최대치에 도달할 때까지 천천히 자동으로 재생됩니다.\n\n\n§l영혼§r\n\n리퍼 직업의 경우 마나 대신 영혼을 사용하여 능력을 시전합니다. 영혼은 대부분의 몹을 처치하여 얻을 수 있습니다.\n\n각 능력의 마나 비용은 다양하지만, 리퍼 직업의 경우 모든 능력에 1 영혼이라는 일정한 비용이 듭니다.\n\n\n§l직업§r\n\n직업은 스킬 포인트로 해금할 수 있는 강력한 아키타입입니다. 패시브 보너스와 특별한 직업 능력을 제공합니다.\n\n직업을 구매한 후 클릭하여 선택할 수 있습니다. 다시 클릭하면 해당 직업 선택이 해제됩니다. 한 번에 하나의 직업만 선택할 수 있으므로 자신의 플레이스타일에 맞는 것을 선택하세요.\n\n\n§l클래스 능력§r\n\n각 직업에는 여러 직업 능력이 있으며, 이는 일반 능력보다 훨씬 강력하고 각 직업의 플레이스타일에 더 적합합니다. 직업 능력 마법서를 웅크린 상태에서 우클릭하여 전환할 수 있습니다.\n\n마법사는 예외로, 특별한 직업 능력이 없으며 대신 네 번째 능력 슬롯을 얻습니다.",

    "roguecraft.tutorial.progression.content": "\n로그크래프트에서 진행 방식은 대대적인 개편을 거쳤습니다. 일반적으로 도움이 필요하면 \"자석석 나침반\" 강화를 해금해 보세요. 이것을 들고 있으면 다음 목표로 안내해 줍니다.\n\n\n§l보스§r\n\n로그크래프트에는 현재 3개의 고유한 보스가 있으며 앞으로 더 추가될 예정입니다. 각 보스를 처치하는 것이 진행의 주요 포인트입니다.\n\n천체의 전당 남쪽 구역에 이상한 방이 있습니다. 거기에 있는 오벨리스크 중 하나를 클릭해 보세요. 아마도 새어 나오는 영혼들이 당신을 끝을 향해 안내할 것입니다.",

    "roguecraft.tutorial.mid_run_upgrades.content": "\n돌 곡괭이만으로 마인크래프트를 깨는 것은 어려울 수 있으므로 도구, 무기, 갑옷 같은 장비를 찾아 장비를 직접 강화할 수 있습니다. 예를 들어, 가죽 갑옷을 입고 철 흉갑을 주우면 흉갑이 철로 직접 강화되며 기존 마법 부여도 유지됩니다.\n\n\n§l마법 부여§r\n\n마법이 부여된 아이템을 찾으면 해당 아이템의 마법 부여가 플레이어의 해당 부위에 추가됩니다. 마법이 부여된 책을 주우면 해당 마법 부여가 적용 가능한 모든 부위에 마법이 부여됩니다.",

    "roguecraft.tutorial.cosmic_dome.content": "\n현재 데이터팩의 허브 지역인 천체의 전당 안에 있습니다. 진행에 중요한 몇 개의 방과 무한의 정원으로 이동할 수 있는 경로가 포함되어 있습니다.\n\n\n§l보관함§r\n\n천체의 전당에 있는 동안 인벤토리에 몇 가지 아이템이 있습니다. 처음 몇 개는 마법서로, 이것들을 들고 해금된 능력 상점을 클릭하여 능력에 바인딩할 수 있습니다.\n다음은 \"자석석 나침반\"으로, 자석석 나침반 강화를 구매하면 단축 바에서 볼 수 있습니다. 이것을 사용하면 봉인 방에 있는 오벨리스크 중 하나를 클릭하여 원하는 진행 경로를 설정할 수 있습니다.\n\n\"강화해제기\" 아이템은 숙이면서 우클릭으로 상점의 강화 레벨을 제거할 수 있게 해줍니다. 참고로 이것은 어떤 스킬 포인트도 반환하지 않습니다. 단지 원하지 않는 강화를 제거할 수 있게 해줍니다.\n\n단축 바의 마지막 아이템은 \"런 시작\" 아이템입니다. 이 아이템을 단순히 우클릭하기만 하면 준비 완료됩니다. 모든 플레이어가 준비되면 새로운 런이 시작됩니다.\n\n인벤토리의 나머지는 로드아웃 아이템으로 채워집니다. 이것들을 로드아웃 상자(강화 지역 입구에 위치)에 넣으면 런 시작 시 인벤토리를 맞춤 설정할 수 있습니다. 로드아웃 상자에 없는 아이템은 런 중에 제공되지 않습니다. 중복 아이템은 런 시작 시 제거됩니다.\n\n\n§l무한의 정원§r\n\n이 지역은 천체의 전당 북쪽 터널을 통해 나가면 접근할 수 있습니다. 런 중 수집한 재료를 사용하여 원하는 무엇이든 지을 수 있는 보조 지역으로 설계되었습니다. 이것들은 광선, 소위 기억 신호기에 나타나며, 무한의 정원 전역에 흩어져 있습니다. 우클릭하기만 하면 아이템을 회수할 수 있습니다.\n\n진행하면서 동물들도 만날 수 있습니다. 단일 런 중 최고 스킬 포인트 양이 높을수록 더 많은 동물을 만나게 되며, 단일 런에서 최대 500 스킬 포인트까지입니다. 아마도 그렇게 되면 특별한 영혼을 찾을 수 있을 것입니다.\n\n무한의 정원에서 길을 잃었거나 천체의 전당으로 빠르게 돌아가고 싶다면, 대화에 \"/trigger hub_tp\"를 입력하세요.",
    
    "roguecraft.tutorial.shops.content": "\n상점은 이 데이터팩에서 진행의 핵심적인 부분입니다. 상점은 천체의 전당에 위치하며, 스킬 포인트를 사용하여 강화, 능력 및 직업을 구매할 수 있습니다.\n\n이 정보 지점의 오른쪽에는 쓸모없는 강화를 0 스킬 포인트에 판매하는 예시 상점이 있습니다. 상점이 어떻게 작동하는지 확인해 볼 수 있습니다.\n\n상점에는 4가지 유형이 있습니다. 첫 번째는 단순히 \"강화 상점\"이라고 불립니다. 이들은 예시 상점과 정확히 같은 방식으로 작동합니다. 최대 레벨에 도달할 때까지 고정 가격으로 강화를 판매합니다.\n\n다음 유형의 상점은 \"점진적 상점\"이라고 불립니다. 이들은 위의 텍스트 표시에서 가격을 표시하지 않고, 대신 핫바 위의 제목에만 표시합니다. 이는 해당 강화의 레벨을 높일수록 가격이 증가하기 때문입니다.\n\n세 번째 유형의 상점은 \"직업 상점\"입니다. 이들은 단순히 직업을 판매합니다. 다른 상점과의 주요 차이점은 레벨이 하나만 있으며, 한 번 해금하면 마우스 오른쪽 버튼을 클릭하여 직업을 선택하거나 선택 해제할 수 있다는 것입니다. 이는 다음 독서대에서 더 설명됩니다.\n\n마지막 상점은 \"능력 상점\"이라고 불립니다. 이들은 능동적인 능력을 판매하며, 점진적 상점처럼 비용이 강화 레벨에 따라 달라집니다. 이 상점들은 항상 최대 레벨 3을 가집니다. 능력 아이템을 표시된 능력에 바인딩하려면 해당 능력 아이템을 들고 상점을 클릭하면 됩니다. \n\n\n§l상점 등급§r\n\n예시 상점 위에 자물쇠가 있는 것을 보았을 것입니다. 자물쇠는 상점 계층을 표시합니다. 상점 계층은 해당 강화의 최고 레벨을 나타내며, 상점의 계층을 높이면 증가합니다. 이는 보스를 처치하여 수행됩니다. 금 자물쇠가 있으면 상점이 완전히 잠겨 있어 어떤 강화도 구매할 수 없습니다. 은 자물쇠는 일부 강화를 구매할 수 있게 해주고, 동 자물쇠는 대부분의 강화를 구매할 수 있게 해주며, 자물쇠가 없는 상점은 완전히 잠금 해제됩니다. -§o강화 제거§r-\n강화 레벨을 낮추고 싶다면, \"강화해제기\" 아이템을 들고 원하는 상점에 가서 §l웅크린 채로§r 우클릭하세요.\n\n중요: 이렇게 해도 스킬 포인트는 돌려받지 못하므로 주의하세요!",
    
    "roguecraft.tutorial.difficulty_level.content": "\n난이도 레벨은 이 데이터팩에서 가장 중요한 난이도 추가 사항 중 하나입니다. 이는 화면 상단에 나타나서 새로운 레벨에 도달할 때까지 서서히 올라갑니다.\n\n난이도 레벨 1에서는 바닐라와 비교해 변경 사항이 없습니다. 그러나 난이도 레벨이 2에 도달하면, 모든 몹이 버프를 받게 됩니다. 이는 좀비와 스켈레톤에게 갑옷을 부여하는 것부터, 크리퍼의 폭발 반경을 증가시키는 것, 심지어 아이템을 들 수 있는 모든 몹에게 불사의 토템을 부여하는 것까지 다양합니다.\n\n난이도 레벨이 10에 도달하면, 몹들은 더 이상 버프를 받지 않지만 대신 플레이어의 체력이 난이도 배수가 레벨 10을 넘어설 때마다 2하트씩 줄어듭니다. 따라서 레벨 11에서는 처음 2하트를 잃게 되고, 레벨 12에서는 다시, 레벨 13에서는 또 다시, 이런 식으로 계속됩니다. 이는 모든 플레이어가 체력 1하트만 남을 때까지 계속됩니다.\n\n이 변경 사항으로 인해, 게임을 클리어하려면 빠르게 진행하는 것이 권장됩니다. 경험이 부족한 플레이어라도 클리어하는 것이 여전히 매우 가능하지만, 스피드런 전략을 배워서 이점을 얻는 것도 좋습니다."
}